added mermaid graph on readme
